--[连续升级]1
--[管理工具版本号]10.34.80
--本脚本支持从ZLHIS+ v10.34.70 升级到 v10.34.80
--请以系统所有者登录PLSQL并执行下列脚本
--脚本执行后，请手工升级导出报表
Define n_System=100;
-------------------------------------------------------------------------------
--结构修正部份
-------------------------------------------------------------------------------



-------------------------------------------------------------------------------
--数据修正部份
-------------------------------------------------------------------------------

--94404:张德婷,2016-03-28,添加外键修正静配性能问题
declare
i number(1);
begin
  select count(constraint_name) into i from user_constraints where constraint_name=upper('输液配药内容_FK_收发id');
  if i=0 then
    delete /*+ parallel(a) */  from 输液配药内容 A where 收发id not in(select id  from 药品收发记录);
  end if;
exception
  When Others Then
    zl_ErrorCenter(SQLCode, SQLErrM);
end;
/

--94404:张德婷,2016-03-24,添加外键修正静配性能问题
Alter Table 输液配药内容 Add Constraint 输液配药内容_FK_收发id Foreign Key (收发id) References 药品收发记录(ID) On Delete Cascade Enable Novalidate;

-------------------------------------------------------------------------------
--权限修正部份
-------------------------------------------------------------------------------





-------------------------------------------------------------------------------
--报表修正部份
-------------------------------------------------------------------------------






-------------------------------------------------------------------------------
--过程修正部份
-------------------------------------------------------------------------------





---------------------------------------------------------------------------------------------------
--更改系统及部件的版本号
-------------------------------------------------------------------------------------------------------
--系统版本号

--部件版本号
Commit;