
--[连续升级]1
--[管理工具版本号]10.34.110
--本脚本支持从ZLHIS+ v10.34.130 升级到 v10.34.140
--请以系统所有者登录PLSQL并执行下列脚本
--脚本执行后，请手工升级导出报表
Define n_System=100;
-------------------------------------------------------------------------------
--结构修正部分
------------------------------------------------------------------------------
--113432:黄捷,2017-11-09,新版体检报到号修改成字符型

--基于调整原有RIS医嘱失败记录.体检报到号字段为字符类型的后续处理。该过程用于删除RIS医嘱失败记录中废弃字段体检报到号_bak
CREATE OR REPLACE Procedure Zl1_Optional_Ris失败记录_删除 Is
Begin
  If Zl_Checkobject(2, '体检报到号_bak', 'RIS医嘱失败记录') > 0 Then
    Execute Immediate 'ALTER TABLE RIS医嘱失败记录 DROP COLUMN 体检报到号_bak';
  End If;
Exception
  When Others Then
    zl_ErrorCenter(SQLCode, SQLErrM);
End Zl1_Optional_Ris失败记录_删除;

/


-------------------------------------------------------------------------------
--数据修正部份
-------------------------------------------------------------------------------


-------------------------------------------------------------------------------------------------------
--更改系统及部件的版本号
-------------------------------------------------------------------------------------------------------
--系统版本号
--可选脚本不用更新
--部件版本号
Commit;