--[连续升级]1
--[管理工具版本号]10.34.0
--本脚本支持从ZLHIS+ v10.34.0 升级到 v10.34.10
--请以系统所有者登录PLSQL并执行下列脚本
--脚本执行后，请手工升级导出报表
Define n_System=100;
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
--79264:刘尔旋,2014-11-26,更新病人挂号记录的医疗付款方式字段
Create Or Replace Procedure Zl_病人挂号记录_更新付款方式(更新时间_In 病人挂号记录.登记时间%Type := Sysdate - 7) As
  --本过程用于添加病人挂号记录中医疗付款方式字段
  --更新时间_In:需要更新医疗付款方式的病人挂号记录的起始时间，如果不传，默认更新7天前之后的所有挂号记录
  v_付款方式 病人挂号记录.医疗付款方式%Type;
Begin
  For r_Regist In (Select NO, 医疗付款方式 From 病人挂号记录 Where 登记时间 >= 更新时间_In) Loop
    If r_Regist.医疗付款方式 Is Null Then
      Begin
        Select b.名称
        Into v_付款方式
        From 门诊费用记录 A, 医疗付款方式 B
        Where a.记录性质 = 4 And a.No = r_Regist.No And a.付款方式 = b.编码 And Rownum < 2;
      Exception
        When Others Then
          v_付款方式 := Null;
      End;
      If v_付款方式 Is Not Null Then
        Update 病人挂号记录 Set 医疗付款方式 = v_付款方式 Where NO = r_Regist.No;
      End If;
    End If;
  End Loop;
Exception
  When Others Then
    zl_ErrorCenter(SQLCode, SQLErrM);
End Zl_病人挂号记录_更新付款方式;



-------------------------------------------------------------------------------------------------------
--更改系统及部件的版本号
-------------------------------------------------------------------------------------------------------
--系统版本号
--可选脚本不用更新
--部件版本号
Commit;

