--[连续升级]1
--[管理工具版本号]10.34.170
--本脚本支持从ZLHIS+ v10.34.160 升级到 v10.34.170
--请以系统所有者登录PLSQL并执行下列脚本
--脚本执行后，请手工升级导出报表
Define n_System=100;
-------------------------------------------------------------------------------
--结构修正部分
------------------------------------------------------------------------------


-------------------------------------------------------------------------------
--数据修正部份
-------------------------------------------------------------------------------
--133387:刘涛,2018-10-31,未审药品收发记录批次修正
--适用范围：所有版本
--修正内容:药品出库房分批入库房不分批，移库申领产生的药品收发记录中未审核的入库明细，将批次不为0的修正为0
--修正范围：修正一个月之内未审核的药品收发记录表的入库房数据
--耗时说明: 药品收发记录共20929589条数据，修正脚本游标查询耗时不到1s；测试环境如下:
--1.硬件环境：PC机
Create Or Replace Procedure Zl1_Optional_收发记录批次_修正 Is
  
  --最近30天未审核的药品移库单，入库房批次不为0的数据
  Cursor c_药品收发记录 Is
    Select ID, 库房id, Nvl(药库分批, 0) 药库分批, Nvl(药房分批, 0) 药房分批
    From 药品收发记录 A, 药品规格 B
    Where a.药品id = b.药品id And a.填制日期 Between Sysdate - 30 And Sysdate And a.单据 = 6 And a.审核日期 Is Null And a.入出系数 = 1 And
          Nvl(a.批次, 0) > 0;

  n_批次属性 Number(1) := 0; --记录指定药品在指定库房是否分批；0-不分批，1-分批
  n_药库性质 Number(1); --指定库房是否只是药库性质的库房
Begin
  For r_药品收发记录 In c_药品收发记录 Loop
    If r_药品收发记录.药房分批 = 0 Then
      --药房不分批，则看药库是否分批
      If r_药品收发记录.药库分批 = 1 Then
        Begin
          Select Distinct 0
          Into n_药库性质
          From 部门性质说明
          Where ((工作性质 Like '%药房') Or (工作性质 Like '制剂室')) And 部门id = r_药品收发记录.库房id;
        Exception
          When Others Then
            n_药库性质 := 1;
        End;
      
        If n_药库性质 = 1 Then
          n_批次属性 := 1;
        Else
          n_批次属性 := 0;
        End If;
      Else
        n_批次属性 := 0;
      End If;
    Else
      n_批次属性 := 1;
    End If;
  
    If n_批次属性 = 0 Then
      Update 药品收发记录 Set 批次 = 0 Where ID = r_药品收发记录.Id;
      Commit;
    End If;
  
  End Loop;

Exception
  When Others Then
    zl_ErrorCenter(SQLCode, SQLErrM);
End Zl1_Optional_收发记录批次_修正;
/

  

-------------------------------------------------------------------------------------------------------
--更改系统及部件的版本号
-------------------------------------------------------------------------------------------------------
--系统版本号
--可选脚本不用更新
--部件版本号
Commit;